{"100j6cg": {"title": "Monthly TFR Express Lane - Post your short retail anecdotes and pandemic-related experiences here!", "flair": "MODPOST", "top_comment": ["j2imuv6", [8, "One time a customer was giving me shit (I refused to change the store's donation policy to suit him), and a huge bee flew right past his head. I put out my hand and it landed on me, so I just said \"excuse me a minute\" to the very angry and utterly confused guy, and put the bee outside. When I came back in he decided to just leave 😂"]]}, "qq743w": {"title": "TalesFromRetail Turns 10!", "flair": "MODPOST", "top_comment": ["hjyzgfk", [24, "I love this sub. It makes me feel like I’m not alone."]]}, "1018rvb": {"title": "Power Outage", "flair": "Medium", "top_comment": ["j2m6d3n", [50, "Customers like our hero would get anything I could serve (not that you had much 😁 \n) for either free or as much of a discount as I was allowed to give."]]}, "100i0ko": {"title": "Guys walk into a blocked aisle…for tape", "flair": "Long", "top_comment": ["j2hxgwb", [154, "Smdh! I had a lady disregard the red cones and try to hit me with her cart to roll through shattered glass and spaghetti sauce. “I’m sorry ma’am but this is a safety hazard and you CANNOT come through here. You MUST go around” 🤦‍♀️"]]}, "100eo7u": {"title": "Different Business", "flair": "Medium", "top_comment": ["j2hhglm", [22, "I love it when Karen’s say they will speak to the manager or call the police, and you call their bluff. Like… OK. Go ahead. You’re still wrong. 😂"]]}, "10086rf": {"title": "Liquor License Divide", "flair": "Short", "top_comment": ["j2gfm2e", [91, "Similar to a supermarket I know in Sydney. For years, it was the only supermarket in all of Sydney, that was allowed to open on Christmas Day...every other supermarket had to close. Why was this one allowed to open? Well, the supermarket was over two levels, and the owners discovered that if they registered each level as a separate business, they could open, as the size of the shop floor for each level was within the maximum size of a business allowed to open on Christmas Day, but combined they would be over the maximum size. All they had to do was ensure that there was a register downstairs to comply...so they put a little coffee shop downstairs. One year, that coffee shop only sold two cups of coffee for the entire shift."]]}, "zzr2dd": {"title": "I'm a Cashier, Not a Daycare Worker", "flair": "Medium", "top_comment": ["j2d6ucl", [392, "What kind of slimeball a.) Cuts a line, and b.) Claims bullying for being called out, and c.) bullies the cashier who is helping them checkout?\n\nGross behavior,  good for you for how you handled it."]]}, "100c96k": {"title": "Okay technically a retail story but the end is dark", "flair": "Short", "top_comment": ["j2h18p9", [14, "And does OP mean ‘Karrie’ was murdered? Obvious choice, but I’m confused by who ‘her’ is in the second paragraph."]]}, "zx11d2": {"title": "Customers told us to reschedule our pipes bursting from the cold weather because it was inconvenient for them to wait while we fixed it.", "flair": "Medium", "top_comment": ["j1xy32r", [383, "See the problem is having pipes in the first place. What do you even need water for?! Just drink from the vending machine, use hand sanitizer and go in buckets or bottles!"]]}, "zx784b": {"title": "Customer attacked my colleague over a pack of cigarettes.", "flair": "Medium", "top_comment": ["j1yvzfo", [277, "Always press charges. Not doing so is why people feel they can get away with treating others like this."]]}}